/**
 * 日期: 2016-04-04  15:24
 * 开发人:刘文  -->  (372065525@qq.com)
 * 功能描述:
 * ).需求说明:
 * ).启动类 Run
 * ).服务器有一个20 个byte 长度的文件,范围索引{0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19},需要断点续传下载到本地
 * ).本地已经下载了该文件的一部分,下载的范围为{0,2},{7,3},{14,1}
 *  )0:0 -> 6   {0,1,2,3,4,5,6}
 *  )1:7 -> 13  {7,8,9,10,11,12,13}
 *  )2:14 -> 19 {14,15,16,17,18,19}
 *    即 文件一共20个byte可以分为 0 到19这20个byte,已下载索引{0,1},{7,8,9},{14}
 * ).现要求分n个线程去下载,都能返回每个线程的,下载区间范围,结果用List返回,
 * ).每个线程中有y个下载区间 ,每段区间用Map<Integer,Integer>,表示开始索引和长度
 * ).List<Map<Integer,Integer>> 存储同一个线程的所有区间
 * )List 是结果返回值,要求返回所有线程的下载范围
 * 举例:
 * ).n = 1 时,返回的数据是    [{2,3,4,5,6},{7,8,9},{13},{14,15,16},{18,19}]
 * ).n = 2 时,返回的数据是  [[{2,3,4,5,6},{10,11}],[{12,13},{15,16,17,18,19}]]
 */
package com.opensourceteams.modules.product.项目.n_03_多线程下载工具.n_02_多线程下载工具_断点续传;